<?php

return [
    //ApiMainController
    '100000' => '机器人等不正常客户禁止请求',
    //FrontendAuthController
    '100001' => '您没有访问权限',
    '100002' => '账号密码错误',
    '100003' => '不明来源没有对应看守器匹配',
    '100401' => '您还没有登录',
    //RegisterController
    '200001' => '短信发送异常',
    '200002' => '验证码已过期',
    '200003' => '验证码错误',
    //TestController
    '100200' => '对不起, 获取账户锁失败!',
    '100201' => '对不起, 帐变参数传递有误!',
    '100202' => '对不起, 帐号异常!',
    '100203' => '对不起, 用户余额不足!',
    '100204' => '对不起, 用户帐变时发生错误!',
];
