<?php

$config = [
            //VG 游戏错误码
           'VG-00'  => 'VG-请求失败',
           'VG-01'  => 'VG-json格式失败',
        // 'VG-0'   => '成功',
           'VG-1'   => 'VG-版本错误',
           'VG-2'   => 'VG-找不到对应的界面',
           'VG-3'   => 'VG-系统错误',
           'VG-4'   => 'VG-网络传送失败',
           'VG-5'   => 'VG-加密失败',
           'VG-6'   => 'VG-解密失败',
           'VG-7'   => 'VG-没有此商户',
           'VG-8'   => 'VG-没有此玩家',
           'VG-9'   => 'VG-新增玩家失败',
           'VG-10'  => 'VG-余额不足',
           'VG-11'  => 'VG-URL错误',
           'VG-12'  => 'VG-此玩家被禁用',
           'VG-13'  => 'VG-玩家钱包转点种类错误',
           'VG-14'  => 'VG-玩家钱包转点订单号重复',
           'VG-15'  => 'VG-玩家钱包转点订单号内容错误',
           'VG-16'  => 'VG-玩家钱包转点订单建立时间过太久',
           'VG-17'  => 'VG-玩家钱包转点金额错误',
         //'VG-18'  => '新增玩家失败 ，失败原因是此玩家已经存在。',
           'VG-999' => 'VG-未知错误',
            //开源棋牌
           'ky-00'  => '开源游戏请求失败',
          ];
return $config;
