<?php

return [
    //FrontendAuthController
    '100001' => '您没有访问权限',
    '100002' => '账号密码错误',
    '100003' => '不明来源没有对应看守器匹配',
    '100401' => '您还没有登录',
    //ApiMainController
    '100100' => '机器人等不正常客户禁止请求',
    '100101' => '当前域名非法',
    '100102' => '当前域名所属平台不存在',
    '100103' => '获取当前域名时出现错误',
    //RegisterController
    '200001' => '短信发送异常',
    '200002' => '验证码已过期',
    '200003' => '验证码错误',
    //TestController
    '100200' => '对不起, 获取账户锁失败!',
    '100201' => '对不起, 帐变参数传递有误!',
    '100202' => '对不起, 帐号异常!',
    '100203' => '对不起, 用户余额不足!',
    '100204' => '对不起, 用户帐变时发生错误!',
    //RechargeController
    '100300' => '充值通道异常,请联系客服!',
    '100301' => '充值金额不在范围内,充值失败!',
    '100302' => '通道太火爆了,请更换金额或选择其他通道充值!',
    '100303' => '系统繁忙,下单失败!',
    '100304' => '第三方所需要的订单保存失败!',
];
